```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.external.git: Refreshing state... [id=-]
module.aws_organization.random_string.random: Refreshing state... [id=si38]
module.serverless_api["example"].module.repository.github_repository.repository: Refreshing state... [id=serverless-example-api]
module.aws_organization.aws_organizations_account.account: Refreshing state...
module.aws_organization.aws_organizations_account.account: Refreshing state... [id=656889719924]
module.aws_logging.data.aws_partition.current: Refreshing state... [id=2020-09-04 03:24:45.115814771 +0000 UTC]
module.aws_logging.data.aws_caller_identity.current: Refreshing state... [id=2020-09-04 03:24:45.407643188 +0000 UTC]
module.aws_api_gateway.aws_api_gateway_domain_name.domain["live"]: Refreshing state... [id=api.scaffold.ly]
module.aws_logging.data.aws_region.current: Refreshing state... [id=us-east-1]
module.dns.aws_route53_delegation_set.main: Refreshing state... [id=N00248303TX9WWXC3DUAK]
module.aws_api_gateway.aws_api_gateway_domain_name.domain["nonlive"]: Refreshing state... [id=api.scaffoldly.dev]
module.aws_logging.aws_s3_bucket.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.dns.module.dns["nonlive"].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/46955869-b3c7-4936-b463-5caea37eb3f5]
module.aws_api_gateway.aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch]
module.dns.module.dns["nonlive"].aws_acm_certificate.apex: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/8135d581-d413-41d4-986c-d9ce3a96a52a]
module.dns.module.dns["live"].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/345cace1-2d73-4acc-a44f-d45752deb801]
module.dns.module.dns["live"].aws_acm_certificate.apex: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/2d620bca-b6a9-4c69-b045-9874dcbf5f30]
module.aws_logging.aws_kms_key.cloudtrail: Refreshing state... [id=f206c800-14d0-4612-86cd-bd6b80b2045e]
module.aws_logging.data.aws_iam_policy_document.bucket_policy: Refreshing state... [id=2777606739]
module.aws_logging.aws_cloudtrail.cloudtrail: Refreshing state... [id=cloudtrail]
module.dns.module.dns["nonlive"].aws_route53_zone.zone: Refreshing state... [id=Z09185361UA62H9QOZ65H]
module.aws_api_gateway.aws_iam_role_policy.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch:default]
module.aws_api_gateway.aws_api_gateway_account.account: Refreshing state... [id=api-gateway-account]
module.dns.module.dns["live"].aws_route53_zone.zone: Refreshing state... [id=Z09171243VWGB0AD4XJAE]
module.aws_logging.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.aws_logging.aws_s3_bucket_public_access_block.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.dns.module.dns["live"].aws_route53_record.verification_record["scaffold.ly"]: Refreshing state... [id=Z09171243VWGB0AD4XJAE__7442a2ae3c77e4c5d4bdc09c99cb7fd4.scaffold.ly._CNAME]
module.dns.module.dns["nonlive"].aws_route53_record.verification_record["scaffoldly.dev"]: Refreshing state... [id=Z09185361UA62H9QOZ65H__5d42b6204724f370284a161fa6ef6dab.scaffoldly.dev._CNAME]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.aws_api_gateway.aws_api_gateway_domain_name.domain["live"] will be destroyed
  - resource "aws_api_gateway_domain_name" "domain" {
      - arn                     = "arn:aws:apigateway:us-east-1::/domainnames/api.scaffold.ly" -> null
      - certificate_arn         = "arn:aws:acm:us-east-1:656889719924:certificate/345cace1-2d73-4acc-a44f-d45752deb801" -> null
      - certificate_upload_date = "2020-09-04T03:27:56Z" -> null
      - cloudfront_domain_name  = "d1wsfpk8fvpys9.cloudfront.net" -> null
      - cloudfront_zone_id      = "Z2FDTNDATAQYW2" -> null
      - domain_name             = "api.scaffold.ly" -> null
      - id                      = "api.scaffold.ly" -> null
      - security_policy         = "TLS_1_2" -> null
      - tags                    = {} -> null

      - endpoint_configuration {
          - types = [
              - "EDGE",
            ] -> null
        }
    }

  # module.aws_api_gateway.aws_api_gateway_domain_name.domain["nonlive"] will be destroyed
  - resource "aws_api_gateway_domain_name" "domain" {
      - arn                     = "arn:aws:apigateway:us-east-1::/domainnames/api.scaffoldly.dev" -> null
      - certificate_arn         = "arn:aws:acm:us-east-1:656889719924:certificate/46955869-b3c7-4936-b463-5caea37eb3f5" -> null
      - certificate_upload_date = "2020-09-04T03:26:11Z" -> null
      - cloudfront_domain_name  = "d2eb9ct155sdce.cloudfront.net" -> null
      - cloudfront_zone_id      = "Z2FDTNDATAQYW2" -> null
      - domain_name             = "api.scaffoldly.dev" -> null
      - id                      = "api.scaffoldly.dev" -> null
      - security_policy         = "TLS_1_2" -> null
      - tags                    = {} -> null

      - endpoint_configuration {
          - types = [
              - "EDGE",
            ] -> null
        }
    }

  # module.aws_api_gateway.module.domain["live"].aws_api_gateway_domain_name.domain will be created
  + resource "aws_api_gateway_domain_name" "domain" {
      + arn                     = (known after apply)
      + certificate_arn         = "arn:aws:acm:us-east-1:656889719924:certificate/345cace1-2d73-4acc-a44f-d45752deb801"
      + certificate_upload_date = (known after apply)
      + cloudfront_domain_name  = (known after apply)
      + cloudfront_zone_id      = (known after apply)
      + domain_name             = "api.scaffold.ly"
      + id                      = (known after apply)
      + regional_domain_name    = (known after apply)
      + regional_zone_id        = (known after apply)
      + security_policy         = "TLS_1_2"

      + endpoint_configuration {
          + types = (known after apply)
        }
    }

  # module.aws_api_gateway.module.domain["live"].aws_route53_record.api_record will be created
  + resource "aws_route53_record" "api_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.scaffold.ly"
      + type            = "A"
      + zone_id         = "Z09171243VWGB0AD4XJAE"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.aws_api_gateway.module.domain["nonlive"].aws_api_gateway_domain_name.domain will be created
  + resource "aws_api_gateway_domain_name" "domain" {
      + arn                     = (known after apply)
      + certificate_arn         = "arn:aws:acm:us-east-1:656889719924:certificate/46955869-b3c7-4936-b463-5caea37eb3f5"
      + certificate_upload_date = (known after apply)
      + cloudfront_domain_name  = (known after apply)
      + cloudfront_zone_id      = (known after apply)
      + domain_name             = "api.scaffoldly.dev"
      + id                      = (known after apply)
      + regional_domain_name    = (known after apply)
      + regional_zone_id        = (known after apply)
      + security_policy         = "TLS_1_2"

      + endpoint_configuration {
          + types = (known after apply)
        }
    }

  # module.aws_api_gateway.module.domain["nonlive"].aws_route53_record.api_record will be created
  + resource "aws_route53_record" "api_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.scaffoldly.dev"
      + type            = "A"
      + zone_id         = "Z09185361UA62H9QOZ65H"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ foo = {
      ~ live    = {
            apex_certificate_arn     = "arn:aws:acm:us-east-1:656889719924:certificate/2d620bca-b6a9-4c69-b045-9874dcbf5f30"
            domain                   = "scaffold.ly"
            wildcard_certificate_arn = "arn:aws:acm:us-east-1:656889719924:certificate/345cace1-2d73-4acc-a44f-d45752deb801"
          + zone_id                  = "Z09171243VWGB0AD4XJAE"
        }
      ~ nonlive = {
            apex_certificate_arn     = "arn:aws:acm:us-east-1:656889719924:certificate/8135d581-d413-41d4-986c-d9ce3a96a52a"
            domain                   = "scaffoldly.dev"
            wildcard_certificate_arn = "arn:aws:acm:us-east-1:656889719924:certificate/46955869-b3c7-4936-b463-5caea37eb3f5"
          + zone_id                  = "Z09185361UA62H9QOZ65H"
        }
    }

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

\n\n0
```